 // Задача: написать программу, для поиска заданного числа в массиве.
 // Если число найдено - вывести "Найдено значение ...", если нет - вывести "Значение ... не найдено"

// Алгоритм
// Шаг 1: НАЧАТЬ
// Шаг 2: Получить массив в arr и число для поиска в x
// Шаг 3: Начните с крайнего левого элемента arr[] и один за другим сравните x с каждым элементом arr[]
// Шаг 4: Если x соответствует элементу Print "Найдено".
// Шаг 5: Если x не совпадает ни с одним из элементов, выведите "Не найдено".
// Шаг 6: КОНЕЦ


// Решение
